HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxSrc_reg.h
/** \\brief  17B0, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM1_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397B0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_4.
*/
#define	SRC_GTMTIM14	(SRC_GTM_GTM0_TIM1_4)

/** \\brief  17B4, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM1_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397B4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_5.
*/
#define	SRC_GTMTIM15	(SRC_GTM_GTM0_TIM1_5)

/** \\brief  17B8, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM1_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397B8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_6.
*/
#define	SRC_GTMTIM16	(SRC_GTM_GTM0_TIM1_6)

/** \\brief  17BC, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM1_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397BCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_7.
*/
#define	SRC_GTMTIM17	(SRC_GTM_GTM0_TIM1_7)

/** \\brief  17C0, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397C0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_0.
*/
#define	SRC_GTMTIM20	(SRC_GTM_GTM0_TIM2_0)

/** \\brief  17C4, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397C4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_1.
*/
#define	SRC_GTMTIM21	(SRC_GTM_GTM0_TIM2_1)

/** \\brief  17C8, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397C8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_2.
*/
#define	SRC_GTMTIM22	(SRC_GTM_GTM0_TIM2_2)

/** \\brief  17CC, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397CCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_3.
*/
#define	SRC_GTMTIM23	(SRC_GTM_GTM0_TIM2_3)

/** \\brief  17D0, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397D0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_4.
*/
#define	SRC_GTMTIM24	(SRC_GTM_GTM0_TIM2_4)

/** \\brief  17D4, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397D4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_5.
*/
#define	SRC_GTMTIM25	(SRC_GTM_GTM0_TIM2_5)

/** \\brief  17D8, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397D8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_6.
*/
#define	SRC_GTMTIM26	(SRC_GTM_GTM0_TIM2_6)

/** \\brief  17DC, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397DCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_7.
*/
#define	SRC_GTMTIM27	(SRC_GTM_GTM0_TIM2_7)

/** \\brief  17E0, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397E0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_0.
*/
#define	SRC_GTMTIM30	(SRC_GTM_GTM0_TIM3_0)

/** \\brief  17E4, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397E4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_1.
*/
#define	SRC_GTMTIM31	(SRC_GTM_GTM0_TIM3_1)

/** \\brief  17E8, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397E8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_2.
*/
#define	SRC_GTMTIM32	(SRC_GTM_GTM0_TIM3_2)

/** \\brief  17EC, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397ECu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_3.
*/
#define	SRC_GTMTIM33	(SRC_GTM_GTM0_TIM3_3)

/** \\brief  17F0, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397F0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_4.
*/
#define	SRC_GTMTIM34	(SRC_GTM_GTM0_TIM3_4)

/** \\brief  17F4, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397F4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_5.
*/
#define	SRC_GTMTIM35	(SRC_GTM_GTM0_TIM3_5)

/** \\brief  17F8, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397F8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_6.
*/
#define	SRC_GTMTIM36	(SRC_GTM_GTM0_TIM3_6)

/** \\brief  17FC, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397FCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_7.
*/
#define	SRC_GTMTIM37	(SRC_GTM_GTM0_TIM3_7)

/** \\brief  1B80, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM0_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039B80u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_0.
*/
#define	SRC_GTMTOM00	(SRC_GTM_GTM0_TOM0_0)

/** \\brief  1B84, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM0_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039B84u)

